#include<stdio.h>
#include<stdlib.h>
#include"coursemanage.h"
#include"init.h"
#include"courseselection.h"
#include"save.h"
#include"studentmanage.h"

/* 主函数&&菜单函数 ------------------------------------------------------------------------------ */
/**
 * 信息主函数
 */
void index_info()
{
    int i;
    printf("+---------------------------------------------------------+\n");
    printf("| 选课信息及存储                                          |\n");
    printf("|---------------------------------------------------------|\n");
    printf("|1 | 查看课程信息                                         |\n");
    printf("|--+------------------------------------------------------|\n");
    printf("|2 | 存储信息                                             |\n");
    printf("|--+------------------------------------------------------|\n");
    printf("|3 | 返回主菜单                                           |\n");
    printf("|---------------------------------------------------------|\n");
    printf("|请输入(1~3):                                             |\n");
    scanf("%d",&i);
    switch(i)
    {
        case(1):list_course();break;
        case(2):save_all();break;
        case(3):break;
    }
}
/**
 * 教师管理系统
 */
void teacher_manage()
{
    int p,i;
    printf("+---------------------------------------------------------+\n");
    printf("| 教师管理系统                                            |\n" );
    printf("+---------------------------------------------------------|\n");
    printf("请输入密码                                                |\n");
    scanf("%d",&p);
    if(p==12345678)
    {
        system("clear");
        printf("+---------------------------------------------------------+\n");
        printf("|                           菜单                          |\n");
        printf("|---------------------------------------------------------|\n");
        printf("|1 | 增加/删除课程                                        |\n");
        printf("|--+------------------------------------------------------|\n");
        printf("|2 | 查看课程信息                                         |\n");
        printf("|--+------------------------------------------------------|\n");
        printf("|3 | 增加/删除学生                                        |\n");
        printf("|--+------------------------------------------------------|\n");
        printf("|4 | 查看学生信息                                         |\n");
        printf("|--+------------------------------------------------------|\n");
        printf("|5 | 返回主菜单                                           |\n");
        printf("|---------------------------------------------------------|\n");
        printf("|请输入(1~5):                                             |\n");
        scanf("%d",&i);
        switch (i) {
            case (1):management_course();break;
            case (2):list_course();break;
            case (3):management_student();break;
            case (4):list_student();break;
            case(5):break;
        }
    }
    else
    {
        printf("+---------------------------------------------------------+\n");
        printf("| 密码错误                                                |\n");
    }
}

int main()  //主函数
{
    int i;
    //system("clear");
    readfile_course();
    readfile_student();

    printf("+---------------------------------------------------------+\n");
    printf("|                   欢迎使用学生选课系统!                 |\n");
    while(1){
        printf("+---------------------------------------------------------+\n");
        printf("|                           主菜单                        |\n");
        printf("|---------------------------------------------------------|\n");
        printf("|1 | 学生选课                                             |\n");
        printf("|--+------------------------------------------------------|\n");
        printf("|2 | 教师管理                                             |\n");
        printf("|--+------------------------------------------------------|\n");
        printf("|3 | 选课信息及存储                                       |\n");
        printf("|--+------------------------------------------------------|\n");
        printf("|4 | 保存并退出系统                                       |\n");
        printf("|--+------------------------------------------------------|\n");
        printf("|5 | 退出系统                                             |\n");
        printf("|---------------------------------------------------------|\n");
        printf("|请输入菜单选项(1~5):                                     |\n");
        scanf("%d",&i);
        if(i<1 || i>5)
        {
            printf("\n");
            printf("+---------------------------------------------------------+\n");
            printf("| 输入错误,请重输:                                        |\n");
            continue;
        }
        switch(i)
        {
            case(1):
            {
                //system("clear"); // windows cls
                elective();
                break;
            }
            case(2):
            {
                //system("clear");
                teacher_manage();
                break;
            }
            case(3):
            {
                //system("clear");
                index_info();
                break;
            }
            case(4):
            {
                //system("clear");
                savefile_course();
                savefile_student();
                printf("+---------------------------------------------------------+\n");
                printf("|  感谢使用本系统!再见!                                   |\n");
                printf("+---------------------------------------------------------+\n");
                break;
            }
            case(5):
            {
                //system("clear");
                printf("+---------------------------------------------------------+\n");
                printf("|  感谢使用本系统!再见!                                   |\n");
                printf("+---------------------------------------------------------+\n");
                exit(0);
                break;
            }
        }
    }

    return 0;
}